[
  {
    "url": "https://www.reddit.com/r/CamGirlProblems/comments/1kqav4m/first_time_getting_my_full_stream_leaked_lmao/",
    "relevance": true,
    "title": "First time getting my full stream leaked LMAO",
    "subtitle": "Starting I knew it was going to happen lol, my first month in I had someone record a clip of me giving head (to a dildo LMAO) or doing lil titty flashes, one of them was from my banned TT acc that they posted literally a year later?? \n\nThis time however, after a year of camming..my full stream start to finish..an almost 3hr stream was leaked. I was able to get it taken down after 2k ppl downloaded it😭 what’s funny tho is that stream was really bad, I had no buzz trains and it was just super dead that day. Which is funny bc some ppl in the comments were like “thanks I can never catch her streams” BUT THAT WAS MY WORST ONE muahahah gotta come back for the good shows bby &lt;33\n\n (idk if I’m lucky, but it’s always the bad stuff they decide to record too, like why record me suckin a dildo when I’ll be fuckin it next show? Like tf lmao) \n\nBut yeah I dunno, I was able to get it taken down w out DMCA(?) just by reporting the vid luckily. I don’t know how many more recordings of me are out there but I’d like to hope that’s the only one, although I assume if there’s 1 leak there’s prob 10 more floating around somewhere lol",
    "comments": []
  },
  {
    "url": "https://www.reddit.com/r/CamGirlProblems/comments/1kf3vcd/stream_was_recorded_posted_without_consent/",
    "relevance": true,
    "title": "Stream was recorded & posted without consent",
    "subtitle": "Going into this, I knew that my stream would be recorded and posted on other sites as soon as I broadcast myself. So please don’t come at me. I’ve only been streaming for 2 days and have found my stream on 10 different sites with 1 google search. I’m not upset that my content is out there, I’m upset that people are now seeing the goods for free😂 Friends & family do know that I cam lol. What removal/takedown services do you use? I submitted one website to Chaturbate’s DMCA form, but read that it could take weeks. Thank you !",
    "comments": []
  },
  {
    "url": "https://www.reddit.com/r/CamGirlProblems/comments/1jyzjjq/is_it_safe_to_give_my_real_name_for_dmca/",
    "relevance": true,
    "title": "Is it safe to give my real name for DMCA ?",
    "subtitle": "Hi, I wanna remove som leak records of my chaturbate but I have to give my real name,\n\nIs it safe ? Does some of you do this and it's work ?\n\nex : [https://webcam-record.com/dmca.php](https://webcam-record.com/dmca.php) / [https://cbrecorder.com/dmca/](https://cbrecorder.com/dmca/)\n\n  \nThanks u &lt;3",
    "comments": []
  },
  {
    "url": "https://www.reddit.com/r/CamGirlProblems/comments/1kf3vcd/stream_was_recorded_posted_without_consent/",
    "relevance": true,
    "title": "Stream was recorded & posted without consent",
    "subtitle": "Going into this, I knew that my stream would be recorded and posted on other sites as soon as I broadcast myself. So please don’t come at me. I’ve only been streaming for 2 days and have found my stream on 10 different sites with 1 google search. I’m not upset that my content is out there, I’m upset that people are now seeing the goods for free😂 Friends & family do know that I cam lol. What removal/takedown services do you use? I submitted one website to Chaturbate’s DMCA form, but read that it could take weeks. Thank you !",
    "comments": []
  },
  {
    "url": "https://i.redd.it/8n3ebkjmr9xe1.jpeg",
    "relevance": true,
    "title": "Content takedown services",
    "subtitle": "Hello, i know a service that takes down any sites or links that leak your content or film your lives… has anyone ever paid one? its subscription based so idk if i wanna try it but it looks totally worth it.. I really want to know your experiences!! i just want it for filmed lives :(",
    "comments": []
  }
]